In [1]:
import pandas as pd
import ast

## Update data destination for synchronize with the field on table database

In [2]:
destination = pd.read_csv('destination.csv')

In [4]:
destination['category'].unique()

array(['Budaya', 'Taman Hiburan', 'Cagar Alam', 'Bahari',
       'Pusat Perbelanjaan', 'Tempat Ibadah'], dtype=object)

In [4]:
destination.head(2)

,id,name_wisata,description_wisata,category,destination_photo,city,price,rating,time_minutes,coordinate,destination_lat,destination_long
0,1,Monumen Nasional,Monumen Nasional atau yang populer disingkat d...,Budaya,https://storage.googleapis.com/tourista_bucket...,Jakarta,20000,4.6,15.0,"{'lat': -6.1753924, 'lng': 106.8271528}",-6.17539,106.8272
1,2,Kota Tua,Kota tua di Jakarta yang juga bernama Kota Tua...,Budaya,https://storage.googleapis.com/tourista_bucket...,Jakarta,5000,4.6,90.0,"{'lat': -6.137644799999999, 'lng': 106.8171245}",-6.13764,106.8171

In [4]:
# remove all except alphanumeric characters + space

destination['description_wisata'] = destination['description_wisata'].str.replace(r'[^a-zA-Z0-9\s]+', '', regex=True)

In [5]:
for index, row in destination.iterrows():
    destination.loc[index, 'destination_photo'] = "https://storage.googleapis.com/tourista_bucket/Banner%20Tourista.png"

In [7]:
destination_part1 = destination[:250]
destination_part2 = destination[250:]

In [9]:
len(destination_part1)

187

In [8]:
# Menyimpan DataFrame ke file CSV
destination_part1.to_csv('./integration_to_db/destination_part1.csv', index=False)
destination_part2.to_csv('./integration_to_db/destination_part2.csv', index=False)

## Update data Hotels

In [2]:
hotels = pd.read_csv('Hotels_Jakarta.csv')

In [3]:
hotels.head()

,Name,Rating,Address,Location
0,ASTON Priority Simatupang Hotel & Conference C...,4.7,"No.Kav. 9, Jl. Let. Jend Jl. TB Simatupang No....","{'lat': -6.3012799, 'lng': 106.8346244}"
1,Hotel Indonesia Kempinski Jakarta,4.7,"Jl. M.H. Thamrin No.1, RT.1/RW.5, Menteng, Kec...","{'lat': -6.1956129, 'lng': 106.8223572}"
2,Urbanest Inn House TB Simatupang,4.5,"Jl. Villa Jatipadang No.52, Jati Padang, Ps. M...","{'lat': -6.296992299999999, 'lng': 106.8322593}"
3,The London Living Kebagusan City,4.3,Apartemen Kebagusan City Tower C KC 06 Jalan B...,"{'lat': -6.306017199999999, 'lng': 106.8359636}"
4,Cove Ostin,4.9,"Jl. TB Simatupang No.15A, RT.11/RW.4, Tj. Bar....","{'lat': -6.3039579, 'lng': 106.843251}"

In [4]:
hotels = hotels.rename(columns={'Name' : 'name_penginapan'})

In [6]:
hotels

,name_penginapan,Rating,Address,Location
0,ASTON Priority Simatupang Hotel & Conference C...,4.7,"No.Kav. 9, Jl. Let. Jend Jl. TB Simatupang No....","{'lat': -6.3012799, 'lng': 106.8346244}"
1,Hotel Indonesia Kempinski Jakarta,4.7,"Jl. M.H. Thamrin No.1, RT.1/RW.5, Menteng, Kec...","{'lat': -6.1956129, 'lng': 106.8223572}"
2,Urbanest Inn House TB Simatupang,4.5,"Jl. Villa Jatipadang No.52, Jati Padang, Ps. M...","{'lat': -6.296992299999999, 'lng': 106.8322593}"
3,The London Living Kebagusan City,4.3,Apartemen Kebagusan City Tower C KC 06 Jalan B...,"{'lat': -6.306017199999999, 'lng': 106.8359636}"
4,Cove Ostin,4.9,"Jl. TB Simatupang No.15A, RT.11/RW.4, Tj. Bar....","{'lat': -6.3039579, 'lng': 106.843251}"
...,...,...,...,...
295,KOST EXCLUSIVE BARKAH,4.1,"Jl. Raya Tengah No.1, RT.5/RW.12, Gedong, Kec....","{'lat': -6.299087, 'lng': 106.8594934}"
296,Nur Residence,4.7,"Jl. Pertanian III No.56, RT.14/RW.5, Ps. Mingg...","{'lat': -6.287287, 'lng': 106.8412007}"
297,OYO Life 2958 Kost Lenteng Agung,4.3,"Jl. Raya Lenteng Agung No.40, RT.4/RW.1, Lente...","{'lat': -6.3099767, 'lng': 106.8371039}"
298,The Hatu Hotel,4.3,"Jl. Hang Tuah I No.2, RT.2/RW.4, Gunung, Kec. ...","{'lat': -6.2335783, 'lng': 106.7973048}"
299,JASMINE RESIDENCE 33,3.1,"Jl. Melati No.33, RT.6/RW.7, Ragunan, Ps. Ming...","{'lat': -6.304216299999999, 'lng': 106.8226384}"

In [10]:
 ast.literal_eval(hotels.Location[0])

"{'lat': -6.3012799, 'lng': 106.8346244}"

## Review wisata

In [2]:
ratings = pd.read_csv('./review_wisata.csv')

In [3]:
destination.head(2)

NameError: name 'destination' is not defined

In [16]:
destinationYK = destination.loc[destination['city'] == 'Yogyakarta']

In [17]:
destinationYK.head(2)

,id,name_wisata,description_wisata,category,destination_photo,city,price,rating,time_minutes,coordinate,destination_lat,destination_long
84,85,Taman Pintar Yogyakarta,Taman Pintar Yogyakarta bahasa Jawa Hanacaraka...,Taman Hiburan,lala.png,Yogyakarta,6000,4.5,120.0,"{'lat': -7.800671500000001, 'lng': 110.3676551}",-7.80067,110.3677
85,86,Keraton Yogyakarta,Keraton Ngayogyakarta Hadiningrat atau Keraton...,Budaya,lala.png,Yogyakarta,15000,4.6,NaN,"{'lat': -7.8052845, 'lng': 110.3642031}",-7.80528,110.3642

In [18]:
destinationYK = destinationYK.rename(columns={'id' : 'wisata_id'})

In [19]:
len(destinationYK)

126

In [20]:
destinationYK = destinationYK[['wisata_id', 'name_wisata']]

In [21]:
destinationYK.head(2)

    wisata_id              name_wisata
84         85  Taman Pintar Yogyakarta
85         86       Keraton Yogyakarta

In [22]:
ratings.head()

   user_wisata  wisata_id  wisata_rating
0            1        179              3
1            1        344              2
2            1          5              5
3            1        373              3
4            1        101              4

In [23]:
merge_ratings = destinationYK.merge(ratings, on='wisata_id')

In [24]:
merge_ratings = merge_ratings.drop(['name_wisata'], axis=1)

In [25]:
merge_ratings

      wisata_id  user_wisata  wisata_rating
0            85            2              4
1            85           23              4
2            85           25              2
3            85           39              5
4            85           43              4
...         ...          ...            ...
2866        210          266              5
2867        210          279              3
2868        210          286              3
2869        210          287              5
2870        210          290              5

[2871 rows x 3 columns]

In [26]:
# Menyimpan DataFrame ke file CSV
merge_ratings.to_csv('./integration_to_db/ratingsYk.csv', index=False)

## users

In [28]:
user_account = pd.read_csv('user_account.csv')

In [29]:
dbuser_account = user_account[1:]

In [30]:
len(dbuser_account)

299

In [8]:
part1_user_account = dbuser_account[:200]
part2_user_account = dbuser_account[200:]

In [31]:
# Menyimpan DataFrame ke file CSV
part1_user_account.to_csv('./integration_to_db/part1_user_account.csv', index=False)
part2_user_account.to_csv('./integration_to_db/part2_user_account.csv', index=False)

## user profile

In [35]:
user_profile = pd.read_csv('./integration_to_db/part2_user_profile.csv')

In [37]:
user_profile.head(2)

,id,username,email,name,age,phone_number,address,photo_profile,user_lat,user_lot,createdAt,updatedAt
0,201,user201,userTrial201@gmail.com,user201,21,81326812647,"Bekasi, Jawa Barat",https://storage.googleapis.com/tourista_bucket...,-11931,12311,08/06/2023 19:54,08/06/2023 19:54
1,202,user202,userTrial202@gmail.com,user202,21,81326812647,"Lampung, Sumatera Selatan",https://storage.googleapis.com/tourista_bucket...,-11931,12311,08/06/2023 19:54,08/06/2023 19:54

In [16]:
print({} + 2)

TypeError: can only concatenate str (not "int") to str

In [38]:
for index, row in user_profile.iterrows():
    user_profile.loc[index, 'createdAt'] = '2023-06-13 00:00:00'
    user_profile.loc[index, 'updatedAt'] = '2023-06-13 00:00:00'

In [39]:
user_profile.head(2)

,id,username,email,name,age,phone_number,address,photo_profile,user_lat,user_lot,createdAt,updatedAt
0,201,user201,userTrial201@gmail.com,user201,21,81326812647,"Bekasi, Jawa Barat",https://storage.googleapis.com/tourista_bucket...,-11931,12311,2023-06-13 00:00:00,2023-06-13 00:00:00
1,202,user202,userTrial202@gmail.com,user202,21,81326812647,"Lampung, Sumatera Selatan",https://storage.googleapis.com/tourista_bucket...,-11931,12311,2023-06-13 00:00:00,2023-06-13 00:00:00

In [9]:
part1_user_profile = user_profile[:200]

In [40]:
# Menyimpan DataFrame ke file CSV
user_profile.to_csv('./integration_to_db/part2_user_profileBGT.csv', index=False)
# part2_user_profile.to_csv('./integration_to_db/part2_user_profile.csv', index=False)

## Ratings Yk

In [4]:
ratingsYK = pd.read_csv('./integration_to_db/ratingsYk.csv')

In [5]:
ratingsYK

      user_wisata  wisata_id  wisata_rating
0               2         85              4
1              23         85              4
2              25         85              2
3              39         85              5
4              43         85              4
...           ...        ...            ...
2866          266        210              5
2867          279        210              3
2868          286        210              3
2869          287        210              5
2870          290        210              5

[2871 rows x 3 columns]

In [6]:
part1 = ratingsYK[:250]
part2 = ratingsYK[251:500]
part3 = ratingsYK[501:750]
part4 = ratingsYK[751:1000]
part5 = ratingsYK[1001:1250]
part6 = ratingsYK[1251:1500]
part7 = ratingsYK[1501:1750]
part8 = ratingsYK[1751:2000]
part9 = ratingsYK[2001:2250]
part10 = ratingsYK[2251:2500]
part11 = ratingsYK[2501:1750]
part12 = ratingsYK[:1751]

In [9]:
part1

     user_wisata  wisata_id  wisata_rating
0              2         85              4
1             23         85              4
2             25         85              2
3             39         85              5
4             43         85              4
..           ...        ...            ...
245          255         94              2
246          270         94              5
247          274         94              3
248          275         94              1
249          276         94              5

[250 rows x 3 columns]

In [8]:
part1.to_csv('./integration_to_db/ratings/part1.csv')
part2.to_csv('./integration_to_db/ratings/part2.csv')
part3.to_csv('./integration_to_db/ratings/part3.csv')
part4.to_csv('./integration_to_db/ratings/part4.csv')
part5.to_csv('./integration_to_db/ratings/part5.csv')
part6.to_csv('./integration_to_db/ratings/part6.csv')
part7.to_csv('./integration_to_db/ratings/part7.csv')
part8.to_csv('./integration_to_db/ratings/part8.csv')
part9.to_csv('./integration_to_db/ratings/part9.csv')
part10.to_csv('./integration_to_db/ratings/part10.csv')
part11.to_csv('./integration_to_db/ratings/part11.csv')
part12.to_csv('./integration_to_db/ratings/part12.csv')